# IdlingEventArgs Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IdlingEventArgs Class
Members See Also
---
The event arguments used by the Idling event.
**Namespace:** Autodesk.Revit.UI.Events**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class IdlingEventArgs : RevitAPIPreEventArgs
```

Visual Basic
---
```text
Public Class IdlingEventArgs _
	Inherits RevitAPIPreEventArgs
```

Visual C++
---
```text
public ref class IdlingEventArgs : public RevitAPIPreEventArgs
```

# Inheritance Hierarchy
System..::..Object System..::..EventArgs Autodesk.Revit.DB.Events..::..RevitAPIEventArgs Autodesk.Revit.DB.Events..::..RevitAPIPreEventArgs Autodesk.Revit.UI.Events..::..IdlingEventArgs
# See Also
IdlingEventArgs Members
Autodesk.Revit.UI.Events Namespace